In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('chicago.csv')
data['Department'] = data['Department'].astype('category')

In [3]:
data.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  category
 3   Employee Annual Salary  32062 non-null  object
dtypes: category(1), object(3)
memory usage: 784.2+ KB

### .lower(), .upper(), .title() and .len() Methods

In [5]:
"HELLO WORLD".lower()

"hello world".upper()

'hello world'.title()

len('hello world')

11

In [6]:
# data['Name'].upper()

In [7]:
data['Name'].str.lower().head()

0        aaron,  elvia j
1      aaron,  jeffery m
2         aaron,  karina
3    aaron,  kimberlei r
4    abad jr,  vicente m
Name: Name, dtype: object

In [8]:
data['Name'].str.title().head()

0        Aaron,  Elvia J
1      Aaron,  Jeffery M
2         Aaron,  Karina
3    Aaron,  Kimberlei R
4    Abad Jr,  Vicente M
Name: Name, dtype: object

In [9]:
pd.DataFrame(data['Position Title'].str.title().head())

             Position Title
0          Water Rate Taker
1            Police Officer
2            Police Officer
3  Chief Contract Expediter
4         Civil Engineer Iv

In [10]:
data['Position Title'].str.len().iloc[:-1].astype(int)

0        16
1        14
2        14
3        24
4        17
         ..
32057    30
32058    14
32059    14
32060    14
32061    23
Name: Position Title, Length: 32062, dtype: int32

### .str.replace() Method

In [11]:
"Hello World".replace('l', 'T')

'HeTTo WorTd'

In [12]:
data.dropna(inplace = True, how  = 'all')
data.tail()

,Name,Position Title,Department,Employee Annual Salary
32057,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,$99528.00
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00

In [13]:
data['Department'] = data['Department'].str.replace('MGMNT', 'MANAGEMENT')
data.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGEMENT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MANAGEMENT,$106836.00

In [14]:
data['Employee Annual Salary'] = data['Employee Annual Salary'].str.replace('$', "").astype(float)

C:\Users\prajw\AppData\Local\Temp\ipykernel_25060\1691439072.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  data['Employee Annual Salary'] = data['Employee Annual Salary'].str.replace('$', "").astype(float)

In [15]:
data['Employee Annual Salary'].nlargest(10)
data['Employee Annual Salary'].idxmax()
data['Employee Annual Salary'].idxmin()

15102

### Filtering with String Methods

In [16]:
data[data['Position Title'].str.lower().str.contains('water')]

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MANAGEMENT,90744.0
554,"ALUISE, VINCENT G",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MANAGEMENT,102440.0
671,"ANDER, PERRY A",WATER CHEMIST II,WATER MANAGEMENT,82044.0
685,"ANDERSON, ANDREW J",DISTRICT SUPERINTENDENT OF WATER DISTRIBUTION,WATER MANAGEMENT,109272.0
702,"ANDERSON, DONALD",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MANAGEMENT,102440.0
...,...,...,...,...
29669,"VERMA, ANUPAM",MANAGING ENGINEER - WATER MANAGEMENT,WATER MANAGEMENT,111192.0
30239,"WASHINGTON, JOSEPH",WATER CHEMIST III,WATER MANAGEMENT,89676.0
30544,"WEST, THOMAS R",GEN SUPT OF WATER MANAGEMENT,WATER MANAGEMENT,115704.0
30991,"WILLIAMS, MATTHEW",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MANAGEMENT,102440.0
31405,"WOODRIDGE, ROBERT L",FOREMAN OF WATER PIPE CONSTRUCTION,WATER MANAGEMENT,102440.0

In [17]:
data[data['Position Title'].str.startswith('WATER')]
data[data['Position Title'].str.endswith('MANAGEMENT')]

,Name,Position Title,Department,Employee Annual Salary
619,"AMADO, BONITA S",DIR OF FACILITIES MANAGEMENT,POLICE,109008.0
1645,"BATIE, FERRIS C",DIR OF FACILITIES MANAGEMENT,GENERAL SERVICES,112308.0
4484,"CHAO, JOSE A",DIR OF FACILITIES MANAGEMENT,CULTURAL AFFAIRS,95820.0
6421,"DAVIS III, WALLACE",GEN SUPT OF WATER MANAGEMENT,WATER MANAGEMENT,119208.0
9751,"GASPAR, RICARDO",DIR OF FACILITIES MANAGEMENT,AVIATION,106848.0
11466,"HARDY, MARIE E",ASST COORD OF COLLECTION MANAGEMENT,PUBLIC LIBRARY,83340.0
12412,"HNATKO, WAYNE S",ASST DIR OF BUILDINGS MANAGEMENT,GENERAL SERVICES,110088.0
14897,"KING, JOHN T",GEN SUPT OF WATER MANAGEMENT,WATER MANAGEMENT,114204.0
18237,"MCFARLAND, ANDREW S",MANAGING ENGINEER - WATER MANAGEMENT,WATER MANAGEMENT,111192.0
23792,"REYNOLDS, DAVID J",COMMISSIONER OF FLEET & FACILITY MANAGEMENT,GENERAL SERVICES,157092.0
25160,"SACHS, LARRY E",DIR OF GRANTS MANAGEMENT,POLICE,97860.0
26171,"SHAW, DORELLE L",COORD OF GRANTS MANAGEMENT,HEALTH,89880.0
27599,"STEWART, VIRGINIA L",COORD OF GRANTS MANAGEMENT,TRANSPORTN,89880.0
29669,"VERMA, ANUPAM",MANAGING ENGINEER - WATER MANAGEMENT,WATER MANAGEMENT,111192.0
30544,"WEST, THOMAS R",GEN SUPT OF WATER MANAGEMENT,WATER MANAGEMENT,115704.0

### strip(), lstrip() and rstrip() Methods

In [18]:
print("     Hello World   ".lstrip())
print("     Hello World   ".rstrip())
print("     Hello World   ".strip())

Hello World
     Hello World
Hello World

In [19]:
data['Name'] = data['Name'].str.strip()
data['Position Title'] = data['Position Title'].str.strip()

### String Methods on Index and Columns

In [20]:
data.set_index(keys = ['Name'], inplace = True)
data.head(3)

                     Position Title        Department  Employee Annual Salary
Name
AARON,  ELVIA J    WATER RATE TAKER  WATER MANAGEMENT                 90744.0
AARON,  JEFFERY M    POLICE OFFICER            POLICE                 84450.0
AARON,  KARINA       POLICE OFFICER            POLICE                 84450.0

In [21]:
data.index = data.index.str.strip().str.title()

In [22]:
data.columns = data.columns.str.upper()
data.head()

,POSITION TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY
Name,,,
"Aaron, Elvia J",WATER RATE TAKER,WATER MANAGEMENT,90744.0
"Aaron, Jeffery M",POLICE OFFICER,POLICE,84450.0
"Aaron, Karina",POLICE OFFICER,POLICE,84450.0
"Aaron, Kimberlei R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,89880.0
"Abad Jr, Vicente M",CIVIL ENGINEER IV,WATER MANAGEMENT,106836.0